In [3]:
import pandas as pd

In [4]:
import numpy as np

In [4]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0]=None

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [12]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data[string_data.notnull()]

1    artichoke
3      avocado
dtype: object

In [16]:
from numpy import nan as NA

In [17]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cle=data.dropna()

In [20]:
cle

     0    1    2
0  1.0  6.5  3.0

In [21]:
cle=data.dropna(how='all')

In [27]:
cle

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
cle=data.dropna(how='all',axis=1)

In [25]:
cle[4]=NA

In [33]:
df=pd.DataFrame(np.random.randn(7,3))

In [34]:
df

          0         1         2
0  1.778100 -0.264906 -1.967917
1  0.704907 -1.988753  0.348612
2 -0.042912 -1.416620  0.822660
3 -0.238417 -0.215674  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [35]:
df.iloc[:4,1]=NA

In [38]:
df.iloc[:2,2]=NA

In [39]:
df

          0         1         2
0       NaN       NaN       NaN
1  0.704907       NaN       NaN
2 -0.042912       NaN  0.822660
3 -0.238417       NaN  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [46]:
df.dropna(thresh=2)

          0         1         2
2 -0.042912       NaN  0.822660
3 -0.238417       NaN  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [47]:
df.fillna(0)

          0         1         2
0  0.000000  0.000000  0.000000
1  0.704907  0.000000  0.000000
2 -0.042912  0.000000  0.822660
3 -0.238417  0.000000  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [48]:
df.fillna({1:0.5,2:0})

          0         1         2
0       NaN  0.500000  0.000000
1  0.704907  0.500000  0.000000
2 -0.042912  0.500000  0.822660
3 -0.238417  0.500000  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [49]:
df

          0         1         2
0       NaN       NaN       NaN
1  0.704907       NaN       NaN
2 -0.042912       NaN  0.822660
3 -0.238417       NaN  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [50]:
df.fillna(method='ffill')

          0         1         2
0       NaN       NaN       NaN
1  0.704907       NaN       NaN
2 -0.042912       NaN  0.822660
3 -0.238417       NaN  0.019372
4  1.329403 -0.299968  1.001053
5  0.266934 -0.583355 -1.113166
6 -0.926272  0.994306  1.131853

In [5]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [6]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [7]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [8]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [9]:
data['v1']=range(7)

In [10]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [11]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [13]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','Bacon','pastrami','honey ham','nova'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [14]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8         nova     6.0

In [24]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova':'salmon'
}

In [25]:
lows=data['food'].str.lower()

In [26]:
lows

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8           nova
Name: food, dtype: object

In [27]:
data['animal']=lows.map(meat_to_animal)

In [28]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8         nova     6.0  salmon

In [29]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [30]:
data=pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],
                 columns=['one','two','three','four'])

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [49]:
transform=lambda x:x[:4].upper()

In [45]:
transform=lambda x:x.upper()

In [50]:
transform

In [51]:
data.index=data.index.map(transform)

In [52]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [53]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [54]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [55]:
bins=[18,25,35,60,100]

In [56]:
cats=pd.cut(ages,bins)

In [57]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [59]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [60]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [61]:
group=['youth','youngadult','middle','senior']

In [62]:
pd.cut(ages,bins,labels=group)

[youth, youth, youth, youngadult, youth, ..., youngadult, senior, middle, middle, youngadult]
Length: 12
Categories (4, object): [youth < youngadult < middle < senior]

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [65]:
pd.cut(ages,4,precision=2)

[(19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.96, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [66]:
cats=pd.qcut(ages,4)

In [67]:
cats

[(19.999, 22.75], (19.999, 22.75], (22.75, 29.0], (22.75, 29.0], (19.999, 22.75], ..., (29.0, 38.0], (38.0, 61.0], (38.0, 61.0], (38.0, 61.0], (29.0, 38.0]]
Length: 12
Categories (4, interval[float64]): [(19.999, 22.75] < (22.75, 29.0] < (29.0, 38.0] < (38.0, 61.0]]

In [68]:
pd.value_counts(cats)

(38.0, 61.0]       3
(29.0, 38.0]       3
(22.75, 29.0]      3
(19.999, 22.75]    3
dtype: int64

In [70]:
d=pd.qcut(ages,[0,0.1,0.5,0.9,1.])

In [71]:
pd.value_counts(d)

(29.0, 44.6]      4
(21.1, 29.0]      4
(44.6, 61.0]      2
(19.999, 21.1]    2
dtype: int64

In [72]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [73]:
data.describe()

       one  two  three  four
count  3.0  3.0    3.0   3.0
mean   4.0  5.0    6.0   7.0
std    4.0  4.0    4.0   4.0
min    0.0  1.0    2.0   3.0
25%    2.0  3.0    4.0   5.0
50%    4.0  5.0    6.0   7.0
75%    6.0  7.0    8.0   9.0
max    8.0  9.0   10.0  11.0

In [74]:
data=pd.DataFrame(np.random.randn(1000,4))

In [75]:
data

            0         1         2         3
0    0.095596 -1.081580  1.951631 -0.520434
1   -0.922466 -0.747809 -0.531791 -1.373035
2   -0.383167 -0.144263  0.358832 -1.560627
3   -1.103055  0.126014  0.073671  0.260077
4   -0.839423 -2.377382  0.461660  0.048132
5   -1.041576 -0.057649  1.850427 -0.175197
6   -1.145501 -2.012664  1.125948 -0.641669
7    0.839628  1.227637 -0.370829 -0.695900
8   -0.519201 -0.871677  1.088206 -1.147246
9   -0.862493 -0.117586 -0.288307  0.674599
10   0.081858 -1.006581 -0.141835 -0.005284
11  -0.621673 -0.989862 -1.199990 -1.392856
12   1.182098 -0.903403 -0.043808 -0.411296
13  -1.082302  0.020066  1.287843  0.464938
14   0.858647 -1.581111 -2.686048 -0.074769
15   0.521478  0.111239  0.515659 -1.897568
16   0.409744 -1.382430  0.516592 -0.485858
17  -1.333238 -0.554302 -2.672249 -1.415047
18   0.887593  0.719756  2.172693  0.164143
19   1.276843 -0.005130 -0.920903  2.495318
20   1.771704 -0.846442  0.780116  0.585422
21  -1.623609  0.100816  2.100239 -0.245617
22   0.427720 -0.795697  1.064464  0.198752
23  -0.876641  1.099274  0.978588 -1.169403
24  -0.375016  0.777872 -0.308789  0.829321
25  -0.335873 -0.046494  1.204353  0.317432
26  -0.090472  0.923694  0.607777 -1.276893
27  -2.594123  1.432128 -1.471045 -0.774024
28  -1.154073 -1.066280 -0.064011  0.757174
29  -0.114032  1.238196 -0.462228 -1.238398
..        ...       ...       ...       ...
970 -0.477368 -0.609718  1.620374 -0.298809
971  1.671011  1.156878  0.199336 -0.076238
972 -0.894348  1.450667  0.284881 -0.241874
973 -0.729238 -0.482807  0.519450 -0.453771
974  1.130016 -0.400037  0.534478 -0.642678
975  0.678903  0.581332  0.175071 -0.105002
976 -1.277688  0.223371 -1.351577  2.887503
977 -1.007505  0.084836 -1.784912  0.500162
978  0.679437 -1.267162 -0.830635 -1.133574
979 -0.213646  0.442548 -0.523873  0.843389
980  0.944862  0.315973  0.168487  0.483667
981  0.654588  1.836954  0.079523  0.562046
982 -0.591603  0.568006 -0.170083  0.018433
983 -0.976785  0.807310 -1.509158 -0.428479
984  0.554026 -0.037219 -0.337282 -0.437048
985 -0.854457 -0.336080 -1.148487  0.472367
986  0.311247 -0.553422 -0.011970 -0.274605
987  1.762784 -0.107317 -2.524796 -0.558097
988 -0.082827 -1.505870 -0.912349 -1.314520
989 -0.349753 -0.841211 -0.317149 -0.520261
990 -0.455042 -1.474990  0.234097  1.288950
991  1.183569  1.898778  0.260968 -0.258242
992 -0.293693  0.572060  1.751900 -0.753360
993  1.519911  2.127963 -0.441905 -2.596233
994  0.948452  1.043036 -1.133894  1.344484
995  2.108676 -1.473269  1.348703  0.944052
996  1.394579  0.678669  0.531408 -0.512496
997 -1.014012 -1.920583  0.588880  0.394430
998  0.158217  0.661841 -0.071072 -1.358374
999  0.464245  0.853979  0.320319 -0.226787

[1000 rows x 4 columns]

In [76]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002593    -0.005085    -0.004812    -0.035162
std       0.981702     1.028374     1.006153     1.023132
min      -3.199899    -3.003915    -2.961144    -3.342892
25%      -0.653624    -0.729026    -0.698634    -0.723054
50%      -0.032356    -0.041508    -0.012427    -0.049090
75%       0.654040     0.680365     0.628386     0.643959
max       3.429532     3.109148     3.641260     3.230541

In [77]:
col=data[2]

In [79]:
col[np.abs(col)>3]

260    3.189517
322    3.641260
Name: 2, dtype: float64

In [81]:
np.abs(data)>3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
5    False  False  False  False
6    False  False  False  False
7    False  False  False  False
8    False  False  False  False
9    False  False  False  False
10   False  False  False  False
11   False  False  False  False
12   False  False  False  False
13   False  False  False  False
14   False  False  False  False
15   False  False  False  False
16   False  False  False  False
17   False  False  False  False
18   False  False  False  False
19   False  False  False  False
20   False  False  False  False
21   False  False  False  False
22   False  False  False  False
23   False  False  False  False
24   False  False  False  False
25   False  False  False  False
26   False  False  False  False
27   False  False  False  False
28   False  False  False  False
29   False  False  False  False
..     ...    ...    ...    ...
970  False  False  False  False
971  False  False  False  False
972  False  False  False  False
973  False  False  False  False
974  False  False  False  False
975  False  False  False  False
976  False  False  False  False
977  False  False  False  False
978  False  False  False  False
979  False  False  False  False
980  False  False  False  False
981  False  False  False  False
982  False  False  False  False
983  False  False  False  False
984  False  False  False  False
985  False  False  False  False
986  False  False  False  False
987  False  False  False  False
988  False  False  False  False
989  False  False  False  False
990  False  False  False  False
991  False  False  False  False
992  False  False  False  False
993  False  False  False  False
994  False  False  False  False
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [86]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
130  3.429532 -1.719715 -1.522178  1.434989
224  3.088509  0.555210  0.379644 -0.623799
258 -3.199899  0.496794 -2.822161  0.618790
260 -1.121938  1.685253  3.189517 -0.395855
284  0.073204 -3.003915 -1.785844  0.736950
322 -0.440766 -0.044024  3.641260 -1.523224
547 -1.060152  0.925173  1.439574 -3.342892
578  3.119439  2.253610 -1.423172  0.020712
770 -1.059533 -1.855556 -1.977181 -3.308633
800  0.782873  3.109148 -0.134691 -0.371247
880  1.117768  1.180173 -0.660206  3.188094
910  3.046464  2.826247  0.224141  0.853474
946  0.508649  0.029139 -1.243634  3.230541

In [88]:
data[np.abs(data)>3]=np.sign(data)*3

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003077    -0.005190    -0.005642    -0.034929
std       0.978866     1.028038     1.003443     1.019846
min      -3.000000    -3.000000    -2.961144    -3.000000
25%      -0.653624    -0.729026    -0.698634    -0.723054
50%      -0.032356    -0.041508    -0.012427    -0.049090
75%       0.654040     0.680365     0.628386     0.643959
max       3.000000     3.000000     3.000000     3.000000

In [91]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [92]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [93]:
sampler=np.random.permutation(5)

In [94]:
sampler

array([0, 1, 3, 4, 2])

In [95]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [96]:
df.sample(n=2)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [97]:
np.random.seed(12345)

In [99]:
values=np.random.rand(10)

In [100]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [101]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [102]:
pd.cut(values,bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [103]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [104]:
val='a,b, guido'

In [105]:
val.find(',')

1

In [106]:
val.count(',')

2

In [107]:
val.replace(',','')

'ab guido'

In [108]:
import re

In [109]:
text="foo bar\t baz  \tqux"

In [110]:
text

'foo bar\t baz  \tqux'

In [111]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex=re.compile('\s+')

In [115]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [116]:
regex.findall(text)

[' ', '\t ', '  \t']